In [1]:
#Dowload necessary libraries
# file path
#connecting to database
#move data into the database
#creating sQLALchemy database engine
#looping through the data chunks and inserting into the database

In [101]:
import pandas as pd
from sqlalchemy import create_engine

In [102]:
nyc_yellow_taxi= "C:/Users/USER/OneDrive/Desktop/cohort_5/archive/yellow_tripdata_2016-02.csv"
db_url= 'postgresql://postgres:****@localhost:5432/c5_project'

In [103]:
date_col = ["tpep_pickup_datetime", "tpep_dropoff_datetime"]
chunk_size=100000
data_chunks=pd.read_csv(nyc_yellow_taxi,chunksize=chunk_size,)
engine=create_engine(db_url)

In [104]:
from time import time

In [105]:
    count = 1
    for chunk in data_chunks:
        if count <=10:
            t_start = time()
            chunk['tpep_pickup_datetime'] = pd.to_datetime(chunk['tpep_pickup_datetime'])
            chunk['tpep_dropoff_datetime'] = pd.to_datetime(chunk['tpep_dropoff_datetime'])
            chunk.to_sql('nyc_yellow_taxi',con=engine,if_exists='append', index=False)
            count +=1
            t_end = time()
            print(f'{count}) loaded a total of {100000*count} records at {t_end - t_start:.2f} seconds')

2) loaded a total of 200000 records at 20.51 seconds
3) loaded a total of 300000 records at 21.60 seconds
4) loaded a total of 400000 records at 20.00 seconds
5) loaded a total of 500000 records at 22.59 seconds
6) loaded a total of 600000 records at 19.76 seconds
7) loaded a total of 700000 records at 19.84 seconds
8) loaded a total of 800000 records at 21.08 seconds
9) loaded a total of 900000 records at 20.00 seconds
10) loaded a total of 1000000 records at 24.87 seconds
11) loaded a total of 1100000 records at 25.05 seconds

BUILDING REPORTING PIPELINE

In [6]:
pip install --force-reinstall "sqlalchemy<2.0.0"

Note: you may need to restart the kernel to use updated packages.

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001807212E3B0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sqlalchemy/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001807212E6B0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sqlalchemy/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001807212E9E0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sqlalchemy/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001807212EB90>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sqlalchemy/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001807212ED40>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sqlalchemy/
ERROR: Could not find a version that satisfies the requirement sqlalchemy<2.0.0 (from versions: none)
ERROR: No matching distribution found for sqlalchemy<2.0.0

In [7]:
import pandas as pd
from sqlalchemy import create_engine

In [8]:
engine = create_engine('postgresql://postgres:****@localhost:5432/c5_project')
engine.connect()

In [9]:
#overview

data = ''' SELECT * FROM nyc_yellow_taxi LIMIT 5


'''
pd.read_sql(data,engine)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2016-02-25 17:24:20,2016-02-25 17:27:20,2,0.70,-73.947250,40.763771,1,N,-73.992012,40.735390,2,5.0,0.0,0.5,0.0,0.0,0.3,5.8
1,2,2016-02-25 23:10:50,2016-02-25 23:31:50,2,5.52,-73.983017,40.750992,1,N,-73.988586,40.758839,2,20.0,0.5,0.5,0.0,0.0,0.3,21.3
2,2,2016-02-01 00:00:01,2016-02-01 00:10:52,6,1.99,-73.992340,40.758202,1,N,-73.964355,40.757977,1,9.5,0.5,0.5,0.7,0.0,0.3,11.5
3,1,2016-02-01 00:00:04,2016-02-01 00:05:16,1,1.50,-73.981453,40.749722,1,N,-73.982323,40.763985,2,6.5,0.5,0.5,0.0,0.0,0.3,7.8
4,2,2016-02-01 00:00:05,2016-02-01 00:20:59,1,5.60,-74.000603,40.729755,1,N,-73.951324,40.669834,1,20.0,0.5,0.5,4.0,0.0,0.3,25.3

In [10]:
# HOW MANY TRIPS WERE RECORDED IN THE DATASET?

In [11]:
total_trip = '''
SELECT COUNT(*) AS total_trip from nyc_yellow_taxi

'''

pd.read_sql(total_trip,engine)

   total_trip
0     1000000

In [12]:
# What is the average trip dstance of all trips?

In [13]:
avg_trip_distance = ''' 

SELECT AVG(trip_distance) FROM nyc_yellow_taxi

'''
pd.read_sql(avg_trip_distance,engine)

        avg
0  2.751403

In [14]:
# WHICH VENDOR HAS THE HIGHEST NUMBER OF TRIPS?

In [15]:
highest_trip_vendor ='''

SELECT "VendorID"
FROM(
    SELECT "VendorID", COUNT(trip_distance) 
    FROM nyc_yellow_taxi
    GROUP BY "VendorID"
    ORDER BY COUNT desc
    LIMIT 1
    ) AS highest_trip_vendor
'''
pd.read_sql(highest_trip_vendor,engine)

   VendorID
0         2

In [16]:
#WHICH VENDOR HAS THE LOWEST NUMBER OF TRIPS?

In [17]:
lowest_trip_vendor = '''

SELECT "VendorID"
FROM(
    SELECT "VendorID", COUNT(trip_distance) 
    FROM nyc_yellow_taxi
    GROUP BY "VendorID"
    ORDER BY COUNT ASC
    LIMIT 1
    ) AS lowest_trip_vendor
'''

pd.read_sql(lowest_trip_vendor,engine)

   VendorID
0         1

In [18]:
#WHAT IS THE AVERAGE PASSENGER COUNT PER TRIP?

In [86]:
avg_passenger_trip='''

SELECT AVG(passenger_count) from nyc_yellow_taxi

'''
pd.read_sql(avg_passenger_trip,engine)

        avg
0  1.631115

             Report_for_operations_and_performance

In [66]:
report_ops= '''
SELECT 
    CURRENT_DATE AS ingestion_date, * FROM
   
(SELECT COUNT(*) AS total_trip FROM nyc_yellow_taxi) AS total_trip,

(SELECT AVG(trip_distance) AS avg_trip_distance FROM nyc_yellow_taxi) AS avg_trip_distance,

(SELECT "VendorID" 
FROM
    (SELECT "VendorID", COUNT(trip_distance) 
    FROM nyc_yellow_taxi
    GROUP BY "VendorID"
    ORDER BY COUNT desc
    LIMIT 1) AS highest_trip_vendor) AS a,
    
(SELECT "VendorID" 
FROM
    (SELECT "VendorID", COUNT(trip_distance) 
    FROM nyc_yellow_taxi
    GROUP BY "VendorID"
    ORDER BY COUNT ASC
    LIMIT 1) AS lowest_trip_vendor) AS b,

(SELECT AVG(passenger_count) from nyc_yellow_taxi) AS avg_passenger_count
'''

result_df = pd.read_sql(report_ops,engine)
print(result_df)

  ingestion_date  total_trip  avg_trip_distance  VendorID  VendorID       avg
0     2023-08-20     1000000           2.751403         2         1  1.631115

                customer_demographics_and_preferences

In [40]:
#WHAT IS THE AVERAGE TRIP AMOUNT GIVEN BY PASSENGERS?

In [67]:
avg_tip_amount='''

SELECT AVG(tip_amount) FROM nyc_yellow_taxi

'''
pd.read_sql(avg_tip_amount,engine)

        avg
0  1.825786

In [68]:
#What is the average trip distance by passengers?

In [79]:
avg_trip_distance_by_passenger ='''

SELECT AVG(trip_distance)
FROM nyc_yellow_taxi
WHERE passenger_count > 0
'''
pd.read_sql(avg_trip_distance_by_passenger,engine)

        avg
0  2.751478

In [44]:
#How many trips were flagged as 'store and forward'?

In [87]:
store_and_forward_trip = '''
SELECT COUNT(store_and_fwd_flag) FROM nyc_yellow_taxi
WHERE  store_and_fwd_flag = 'Y'
'''
pd.read_sql(store_and_forward_trip,engine)

   count
0   5918

In [46]:
#How many trips were shared rides (passenger count > 1)?

In [90]:
shared_ride_count ='''
SELECT COUNT(passenger_count) FROM nyc_yellow_taxi
where trip_distance > 0 AND passenger_count >1
'''
pd.read_sql(shared_ride_count,engine)

    count
0  266145

                    Report_for_ customer_demographics_and_preferences

In [91]:
report_cdp='''
SELECT 
    CURRENT_DATE AS ingestion_date, * FROM
   
(SELECT AVG(tip_amount) FROM nyc_yellow_taxi) AS avg_tip_amount,

(SELECT AVG(trip_distance)
FROM nyc_yellow_taxi
WHERE passenger_count > 0) AS avg_trip_distance_by_passenger,

(SELECT COUNT(store_and_fwd_flag) FROM nyc_yellow_taxi
WHERE  store_and_fwd_flag = 'Y') AS store_and_forward_trip,

(SELECT COUNT(passenger_count) FROM nyc_yellow_taxi
where trip_distance > 0 AND passenger_count >1) AS shared_ride_count

'''
result_df2 = pd.read_sql(report_cdp,engine)
print(result_df2)

  ingestion_date       avg       avg  count   count
0     2023-08-20  1.825786  2.751478   5918  266145

                financial_performance

In [ ]:
#What is the average fare amount per trip?

In [93]:
avg_fare_amount ='''
SELECT AVG(fare_amount) FROM nyc_yellow_taxi

'''
pd.read_sql(avg_fare_amount,engine)

         avg
0  12.343774

In [50]:
#How much revenue was generated from tolls and surcharges combined?

In [94]:
tolls_and_surcharges_revenue ='''
SELECT SUM(tolls_amount + improvement_surcharge) FROM nyc_yellow_taxi AS total_revenue

'''
pd.read_sql(tolls_and_surcharges_revenue,engine)

             sum
0  598262.799997

In [52]:
#What is the average total amount paid by passengers?

In [95]:
avg_total_amount ='''

SELECT AVG(total_amount) FROM nyc_yellow_taxi

'''
pd.read_sql(avg_total_amount,engine)

         avg
0  15.578133

                               Report_financial_performance

In [96]:
report_fp='''
SELECT 
    CURRENT_DATE AS ingestion_date, * FROM
    
(SELECT AVG(fare_amount) FROM nyc_yellow_taxi) AS avg_fare_amount,

(SELECT SUM(tolls_amount + improvement_surcharge) FROM nyc_yellow_taxi AS total_revenue) AS tolls_and_surcharges_revenue,

(SELECT AVG(total_amount) FROM nyc_yellow_taxi) AS avg_total_amount

'''

result_df3=pd.read_sql(report_fp, engine)
print(result_df3)

  ingestion_date        avg            sum        avg
0     2023-08-20  12.343774  598262.799997  15.578133

In [97]:
result_df.to_sql('nyc_reporting_table_op', con=engine,if_exists='append')
result_df2.to_sql('nyc_reporting_table_cdp', con=engine,if_exists='append')
result_df3.to_sql('nyc_reporting_table_fp', con=engine,if_exists='append')

1

In [98]:
def transform_data (query,connection):
    try:
        report_query = pd.read_sql(query,connection)
        print ('successfully transformed the data')
        return report_query
    except:
        print('Encountered error while transforming')

In [99]:
def load_report_to_warehouse(dataframe,table,connection):
    try:
        dataframe.to_sql(table, con=connection,if_exists='append')
        print(f'successfully updated {table} table')
    except:
        print(f'could not update {table}')

In [100]:
#RUNNING THE ENTIRE PROCESS
result_df = transform_data(report_ops,engine)
load_report_to_warehouse(result_df,'nyc_reports',engine)

result_df2 = transform_data(report_cdp,engine)
load_report_to_warehouse(result_df2,'nyc_reports_2',engine)

result_df3 = transform_data(report_fp,engine)
load_report_to_warehouse(result_df3,'nyc_reports_3',engine)

successfully transformed the data
successfully updated nyc_reports table
successfully transformed the data
successfully updated nyc_reports_2 table
successfully transformed the data
successfully updated nyc_reports_3 table